nguyenduchan/coutingmachine/firmware/Core/Inc/stm32g0xx_hal_conf.h
/**
  ******************************************************************************
  * @file    stm32g0xx_hal_conf.h
  * @brief   HAL config for CountingMachine G030 — minimal modules
  ******************************************************************************
  */
#ifndef STM32G0xx_HAL_CONF_H
#define STM32G0xx_HAL_CONF_H

#ifdef __cplusplus
extern "C" {
#endif

#define HAL_MODULE_ENABLED
#define HAL_CORTEX_MODULE_ENABLED
#define HAL_DMA_MODULE_ENABLED
#define HAL_EXTI_MODULE_ENABLED
#define HAL_FLASH_MODULE_ENABLED
#define HAL_GPIO_MODULE_ENABLED
#define HAL_PWR_MODULE_ENABLED
#define HAL_RCC_MODULE_ENABLED

#define USE_HAL_ADC_REGISTER_CALLBACKS        0u
#define USE_HAL_CEC_REGISTER_CALLBACKS        0u
#define USE_HAL_COMP_REGISTER_CALLBACKS       0u
#define USE_HAL_CRYP_REGISTER_CALLBACKS       0u
#define USE_HAL_DAC_REGISTER_CALLBACKS        0u
#define USE_HAL_FDCAN_REGISTER_CALLBACKS      0u
#define USE_HAL_I2C_REGISTER_CALLBACKS        0u
#define USE_HAL_I2S_REGISTER_CALLBACKS        0u
#define USE_HAL_IRDA_REGISTER_CALLBACKS       0u
#define USE_HAL_LPTIM_REGISTER_CALLBACKS      0u
#define USE_HAL_HCD_REGISTER_CALLBACKS        0u
#define USE_HAL_PCD_REGISTER_CALLBACKS        0u
#define USE_HAL_RNG_REGISTER_CALLBACKS        0u
#define USE_HAL_RTC_REGISTER_CALLBACKS        0u
#define USE_HAL_SMARTCARD_REGISTER_CALLBACKS  0u
#define USE_HAL_SMBUS_REGISTER_CALLBACKS      0u
#define USE_HAL_SPI_REGISTER_CALLBACKS        0u
#define USE_HAL_TIM_REGISTER_CALLBACKS        0u
#define USE_HAL_UART_REGISTER_CALLBACKS       0u
#define USE_HAL_USART_REGISTER_CALLBACKS      0u
#define USE_HAL_WWDG_REGISTER_CALLBACKS       0u

#define HSE_VALUE    (8000000UL)
#define HSE_STARTUP_TIMEOUT (100UL)
#define HSI_VALUE    (16000000UL)
#define HSI_STARTUP_TIMEOUT (5000UL)
#define LSI_VALUE    (32000UL)
#define LSE_VALUE    (32768UL)
#define LSE_STARTUP_TIMEOUT (5000UL)
#define EXTERNAL_I2S_CLOCK_VALUE    (12288000UL)
#define EXTERNAL_I2S1_CLOCK_VALUE   (12288000UL)
#define EXTERNAL_I2S2_CLOCK_VALUE   (12288000UL)

#define VDD_VALUE                    3300UL
#define TICK_INT_PRIORITY            3U
#define USE_RTOS                     0U
#define PREFETCH_ENABLE              1U

#define USE_FULL_ASSERT    0U

#include "stm32g0xx_hal_rcc.h"
#include "stm32g0xx_hal_gpio.h"
#include "stm32g0xx_hal_dma.h"
#include "stm32g0xx_hal_cortex.h"
#include "stm32g0xx_hal_flash.h"
#include "stm32g0xx_hal_flash_ex.h"
#include "stm32g0xx_hal_exti.h"
#include "stm32g0xx_hal_pwr.h"
#include "stm32g0xx_hal_pwr_ex.h"

#ifdef USE_FULL_ASSERT
#define assert_param(expr) ((expr) ? (void)0U : assert_failed((uint8_t *)__FILE__, __LINE__))
void assert_failed(uint8_t *file, uint32_t line);
#else
#define assert_param(expr) ((void)0U)
#endif

#ifdef __cplusplus
}
#endif

#endif /* STM32G0xx_HAL_CONF_H */
